# GroupAllowedViewTypes Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GroupAllowedViewTypes Property
ParameterTypeId Class See Also
---
"Allowed View Types"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GroupAllowedViewTypes { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GroupAllowedViewTypes As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GroupAllowedViewTypes {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace